package models;

import service.TaskProcess;

public abstract class Task {

	public Iteration[] solving;
	public Iteration[] testing;
	public Iteration[] refactoring;
	public double[] partTime;
	public double time;

	public static void main(String[] args) {
		double[][] arr = { {0, 0, 0, 0, 0, 0.05, 0.05, 0.1, 0.1, 0.4, 0.3},
				{ 0.1, 0.2, 0.2, 0.15, 0.1, 0.1, 0.1, 0.05, 0, 0, 0 },
				{ 0.1, 0.2, 0.25, 0.2, 0.1, 0.1, 0.05, 0, 0, 0, 0 },
				{ 0.5, 0.3, 0.15, 0.05, 0, 0, 0, 0, 0, 0, 0 },
				{ 0.4, 0.3, 0.25, 0.05, 0, 0, 0, 0, 0, 0, 0 },
				{ 0.2, 0.25, 0.15, 0.15, 0.1, 0.1, 0.05, 0, 0, 0, 0 },
				{ 0.2, 0.25, 0.3, 0.15, 0.1, 0.0, 0.0, 0, 0, 0, 0 },
				{ 0.4, 0.35, 0.25, 0.0, 0, 0, 0, 0, 0, 0, 0 },
				{ 0.3, 0.35, 0.25, 0.1, 0.0, 0.0, 0.0, 0, 0, 0, 0 },
				{ 0.15, 0.25, 0.35, 0.2, 0.05, 0.0, 0.0, 0, 0, 0, 0 },
				{ 0.15, 0.3, 0.35, 0.15, 0.05, 0.0, 0.0, 0, 0, 0, 0 }};
		for (int i=0;i<arr.length;i++){
				System.out.println(arr[i][0]*0+arr[i][1]*1+arr[i][2]*2+arr[i][3]*3+arr[i][4]*4+
						arr[i][5]*5+arr[i][6]*6+arr[i][7]*7+arr[i][8]*8+arr[i][9]*9+arr[i][10]*10);
				System.out.println(TaskProcess.getSumArray(arr[i]));
				System.out.println("");
		}
		
	}
}
// ум и опыт diff: 8.607280845398114
// мотивация diff: 2.840164358308813
// организация кода diff: 2.538006322387773
// понятность кода diff: 0.7563645401357213
// удобство и производительность ПО, компьютеров и инфраструктуры diff:
// 0.9634765630534773
// условия труда diff: 2.3014149342298293
// синергия diff: 1.6322239442525313
// стабильность внешних модулей diff: 0.8347260165873271
// отсутствие форс-мажоров diff: 1.1202803570642106
// взаимопонимание с клиентом diff: 1.7284266340687267
// слаженность действий команды diff: 1.6776354845134713